Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: При сворачивании узлов в Подмодель флаг необязательности устанавливается только у входных портов типа Таблица, к которым внутри Подмодели подключены необязательные порты.
en: When collapsing nodes to theSupernode, optionality checkbox is selected only for the input ports related to the Table type to which optional ports are connected inside the Supernode.

source: При сохранении пакета пароль урезался до 32 байт и, как следствие, после повторного открытия пакета подключение к базе данных не работало (#9462).
en: When saving the package, the password was cut up to 32 bytes, and in the result, the connection to database didn't work after the repeated opening of the package (#9462).

source: При таком использовании значительно увеличивается скорость обработки данных.
en: Data processing speed will be considerably increased in such case of use.

source: При установке Loginom Integrator можно задать параметр Unix Socket в диалоге настроек.
en: When installing Loginom Integrator, it is possible to set Unix Socket parameter in the customization dialog.

source: При установке платформы в качестве рабочего каталога используется папка «Мои документы» текущего пользователя.
en: When installing the platform, "My documents" folder of the current user is used as the working directory.

source: При фильтрации по уникальным значениям в Кубе снято ограничение в отображении не более 10000 уникальных элементов.
en: When filtering by unique values, restriction in displaying not more than 10000 unique items was removed in the Cube.

source: При формировании набора полей, в исходном наименовании все невалидные символы заменяются и формируется корректное имя поля или же значение по умолчанию, если не получилось сформировать корректный идентификатор.
en: When fields set is generated, all invalid characters are replaced in the source name and the correct field name or the default value is generated if it is not possible to generate the correct identifier.

source: При экспорте в базы данных, если выбран тип экспорта «Обновить существующие записи в таблице» и ключевое поле содержит значения NULL, то происходит корректное сравнение значений с использованием конструкции IS NULL.
en: When exporting to the databases, if "Update existing table records" export type is selected, and the key field contains NULL values, the correct comparison of values is performed with the use of IS NULL construction.

source: При этом не происходило выделение узла.
en: In this case, the node was not selected.

source: При этом невозможно было понять, каким пользователем или процессом занят пакет.
en: And it was not possible to define the user or process that used the package.

source: При этом пакет продолжал выполняться.
en: But the package was still being executed.

source: При этом подключение, которое использует узел SOAP-запрос, настроено на корневой WSDL документ Loginom Integrator /soap?wsdl (#9855).
en: In this case, the connection that uses the SOAP request node is configured to the root WSDL document Loginom Integrator /soap?wsdl (#9855).

source: При этом сам опубликованный пакет работал корректно.
en: In this case the published package worked correctly.

source: При этом установка больших значений параметров "Таймаут подключения" и "Таймаут обмена данными" в настройках подключения к REST-сервису на данную ситуацию не влияли.
en: In this case, set large values of "Connection timeout" parameters and "Data exchange timeout" in REST service connection settings didn't influence the situation.

source: При этом, имена, заканчивающиеся точкой или пробелом, запрещены.
en: And the names ending with a point or space are forbidden.

source: Пример записи:
en: Record example:

source: Прирост производительности будет на подключениях, созданных в Loginom 7.0.3 (#8213).
en: Performance improvement will be observed for the connections created in Loginom 7.0.3 (#8213).

source: Приходилось завершать публикацию такого пакета и снова его публиковать для устранения ошибки.
en: Publication of such package was to be terminated, and it was to be published once again to fix the problem.

source: Проблема была в том, что данном контексте «По умолчанию» для «Ограничитель строк» использовать не логично, и это путается с «По умолчанию» для других параметров.
en: The problem was that "By default" for "Text qaulifier" was not logically used in that context. It was confused with "By default" for other parameters.

source: Проблема возникала, если на одном компьютере с Linux было несколько пользователей, у которых установлен Loginom.
en: The problem occurred if there were several users of one Linux computer with installed Loginom.

source: Проблема наблюдалась не для всех текстовых полей и не на всех версиях.
en: The problem was observed not for all text fields and not in all versions.

source: Проблема наблюдалась при включенной автосинхронизации.
en: The problem was observed when automapping was enabled.

source: Проблема приводила к некорректной работе компонента если при обучении в дискретных данных появились новые значения (которых не было при расчёте статистики).
en: The problem caused the incorrect component operation if new values (that were absent while statistics calculation) appeared in the discrete data while training.

source: Проблема характерна для некоторых браузеров (например, Chrome).
en: The problem is typical of some browsers (for example, Chrome).

source: Проблему первого запуска решили (#9720).
en: The problem of the first launch was solved (#9720).

source: Проблему решили (#7868).
en: The problem was solved (#7868).

source: Проблему решили.
en: The problem was solved.

source: Проблему с завершением потоков устранили (#10313).
en: The problem with streams closing failure was fixed (#10313).

source: Проведена значительная работа, направленная на улучшение и оптимизацию работы с базами данных.
en: Considerable work aimed at improvement and optimisation of database use has been done.

source: Проверка корректности пути.
en: Check path correctness.

source: Проверка производится на раннем этапе, чтобы отображалось более правильное сообщение о проблеме (#9181).
en: The check was performed at the earlier stage to display the correct error message (#9181).

source: Проектирование и отладка логики анализа данных занимает у аналитиков — основных пользователей Loginom — большое количество времени.
en: Data analysis logics debugging and design take much time of the analysts who are the main Loginom users.

source: Производительность
en: Performance

source: Пропорции «событий» и «не событий» могут задаваться автоматически на основе данных обучающего или тестового множества, а также задаваться вручную в мастере настройки или интерактивно в визуализаторе Качество бинарной классификации.
en: Events to non-events ratio can be automatically set according to the training or test set data and it can be also manually set in the wizard or interactively in Binary сlassification assessment visualizer.

source: Прочие изменения
en: Other Changes

source: Публикация веб-сервисов стала доступна в редакции Team.
en: Publication of web services became available in the Team edition.

source: Работа Python, в отличие от JavaScript, не ограничивается средой исполнения, а выполняемый код имеет полный доступ к операционной системе и сетевым протоколам.
en: As opposed to JavaScript, the Python operation is not restricted by the runtime environment and the executed code has full access to the operational system and network protocols.

source: Работа с Веб-сервисами
en: Web Services Operation

source: Работа с базами данных
en: Databases Operation

source: Работа с данными
en: Data Handling

source: Размер данных должен быть больше или равен нулю» (#8180).
en: Data size must be more than or equal to zero" (#8180).

source: Разрешение на публикацию пакетов можно установить только для пользователей, у которых есть роль «Проектирование сценариев».
en: Only the users with "Workflows design" role are allowed to get permission to publish the packages.

source: Ранее IP клиента определялся как IP proxy 2 (#9541).
en: Previously, client IP was defined as IP proxy 2 (#9541).

source: Ранее Диспетчер зависал, если пакет или сессия пользователя содержали зависшие процессы (#8338).
en: Previously, the Session Manager was frozen, if the package or user session contained frozen processes (#8338).

source: Ранее были доступны только методы POST и GET.
en: Previously, only POST and GET methods were available.

source: Ранее в мастерах импорта и экспорта в БД для Oracle (а также для некоторых БД при подключении через ODBC) можно было получить пустой список полей для таблицы с именем, записанном в нижнем регистре (#9203).
en: Previously, it was possible to receive an empty list of fields for the table with the lowercase recorded name in the import and export wizards for DB for Oracle (and also for some DB when connecting via ODBC) (#9203).

source: Ранее в мастере настройки подключения к базам данных некорректно отображался редактора настроек SSL при изменении масштаба браузера (#9252).
en: Previously, SSL settings editor was incorrectly displayed in the wizard of database connection when changing the browser scale (#9252).

source: Ранее в подмодель можно было свернуть только несколько выделенных узлов.
en: Previously, it was possible to collapse only several selected nodes to supernode.

source: Ранее в процессе вырезания/вставки узлов могла возникнуть блокировка узлов, в результате чего могли происходить ошибки.
en: Nodes locking could occur earlier while cutting/inserting the nodes that could cause errors.

source: Ранее в таком случае активация узла Квантование завершалась ошибкой Out of memory (#9638).
en: Previously, in this case activation of Binning node caused Out of memory error(#9638).

source: Ранее во время настройки импорта из Calcculation view SAP HANA, при наличии таких таблиц/схем, попытка выбора таблицы из списка или ввода ее имени в поле «Таблица/представление» приводила к ошибке «Неверно указано имя таблицы».
en: Previously, when configuring import from Calculation view SAP HANA, in the case of such tables/schemas, attempt to select the table from the list or enter its name in the "Table/View" field, caused the following error: "Invalid table name".

source: Ранее выводилось оповещение об ошибке, загрузка пакета прерывалась (такой пакет не открывался).
en: Previously, it was informed about an error, the package loading was terminated (such package was not opened).

source: Ранее для непрерывных значений при единственном классе его метка формировалась в виде «до %d» (например, «до 9»), теперь будет «…».
en: Previously, in the case of the single class its caption for the continuous values was generated as follows: "up to %d" (for example, "up to 9"). Now, it will be as follows: "...".

source: Ранее для строковых полей нельзя было в качестве значения замены указать null-значение (#3206).
en: Previously, it was not possible to state the null value for the string fileds as the replace value (#3206).

source: Ранее для этого требовалось ввести в поле пробел, а затем удалить его (#9586).
en: Previously, for this purpose it was required to enter a space into the field and then it was deleted (#9586).

source: Ранее для Фактов устанавливались «Назначения по умолчанию» равное Показатель, а для Измерений - Группа.
en: Previously, "Default usage types" equal to Value, and for Dimensions - Group were set for Measures .

source: Ранее его можно было использовать только для строкового и логического типов.
en: Previously, it was possible to use it only for the string and logical types.

source: Ранее запросы, в тексте которых содержались символы Unicode не работали (#9067).
en: Previously, the requests with Unicode characters did not work (#9067).

source: Ранее значение в столбце «Код завершения» равнялось 0 не зависимо от Кода состояния HTTP.
en: Previously, the value in "Error code" column was equal to 0 irrespective of HTTP Status Code.

source: Ранее логирование выполнялась только в случае блокировки сессии по тайм-ауту неактивности (#10276).
en: Previously, logging was performed only when the session was locked by idle timeout (#10276).

source: Ранее логирование имени узла было предусмотрено только при логировании в базу данных.
en: Previously, the node name logging was provided only for logging to the database.

source: Ранее могла возникать ошибка «Access violation» или в итоговой строке содержалась произвольная последовательность символов при получении из Python строки длиной более 1365 символов кириллицей или более 2048 латинских символов.
en: Previously, "Access violation" error could occur or random sequence of characters was in the final row when receiving the row from Python with a length exceeding 1365 Cyrillic characters or 2048 Latin characters.

source: Ранее можно было наблюдать ситуацию, когда для англоязычной версии Windows в русскоязычной версии Loginom почти все надписи в окне файлового диалога были на английском языке (т.к. Windows английский), а несколько элементов управления — на русском.
en: Previously, it was observed that almost all texts in the file dialog window for the English Windows version in the Russian Loginom version were in the English language (because Windows was in English), and several control elements were in the Russian language.

source: Ранее не было возможности получить и использовать этот идентификатор.
en: Previously, it was not possible to get and use this identifier.

source: Ранее нельзя было задать вручную дату с точностью до секунды (например, при задании переменной типа Дата/Время) (#9204).
en: Previously, it was not possible to set the date manually within the accuracy of a second (for example, when setting the Date/Time type variable) (#9204).

source: Ранее никак не учитывался http-статус полученного от сервера ответа, и его значение не возвращалось ни в одном из выходных портов.
en: Previously, http status of the response received from the server was not taken into account, and its value was returned in none of the output ports.

source: Ранее операция «Вырезать-Вставить» могла занимать продолжительное время, а также при копировании каталогов с объемом больше 2 Гб можно было в процессе копирования на соседней вкладке вырезать подкаталог копируемого каталога (#6031, #6366).
en: Previously, "Cut-Paste" operation could take much time, and when copying 2 GB directories, it was possible to cut the subdirectory of the copied directory in the next tab while copying (#6031, #6366).

source: Ранее отображался текст «последнее период до ...», теперь «последний период до ...», т.е. учтены особенности русского языка (#8848).
en: Previously, the following text was displayed: "last period to...". Now the following text is displayed: "last perfiod before...". Thus, peculiarities of the Russian language were taken into account (#8848).

source: Ранее ошибку можно было заметить:
en: Previously, the error could be observed here:

source: Ранее ошибочно в качестве значения такого выражения всегда возвращалось NULL (#10303).
en: Previously, NULL always returned as the value of such expression that wasn't right (#10303).

source: Ранее пользователи часто путали значение «По умолчанию» для «Ограничителя строк» с аналогичным значением для других параметров (#5351).
en: Previously, users often confused "By default" value for "Text qualifier" with the same value for other parameters (#5351).

source: Ранее попытки выполнения этих действий могли приводить к неинформативным сообщениям (#8170).
en: Previously, attempts to perform these actions could cause undescriptive messages (#8170).

source: Ранее после добавления каждого измерения Куб перестраивался, и при больших объемах данных настройка Куба занимала много времени.
en: Previously, after adding each dimension, the Cube was rebuilt, and the Cube configuration took much time for the large data volumes.

source: Ранее при выполнении могла изменяться модель начальных классов, а результат выполнения мог отличаться от ожидаемого.
en: Previously, the fine classes model could be changed while execution, and the execution result could differ from the expected one.

source: Ранее при использовании pandas и пакета numexpr запуск узла Python приводил к ошибке "Offset exceed JPM opcode limit".
en: Previously, when using pandas and numexpr package, start of the Python node caused the following error: "Offset exceed JPM opcode limit".

source: Ранее при нажатии на кнопку "Тестировать" или "Подключить" проверяли только правильность установленных параметров (#6194).
en: Previously, when pressing on "Test" or "Connect" button, correction of the installed parameters was checked (#6194).

source: Ранее при попытке открытия такого пакета он не открывался и выводилась ошибка.
en: Previously, when trying to open such package, it was not opened, and an error was shown.

source: Ранее при попытке передать в функцию builtin_pandas_utils.to_data_frame таблицу, содержащую целочисленный или логический столбец с пропущенными значениями, возникала ошибка "...int() argument must be a string, a bytes-like object or a number, not 'NoneType' " (#8522).
en: Previously, while attempting to transfer the table containing the integer or logical column with null values to builtin_pandas_utils.to_data_frame function, the following error occurred: "...int() argument must be a string, a bytes-like object or a number, not 'NoneType' " (#8522).

source: Ранее при ручном редактировании границ, их значение отображалось с округлением до двух знаков после запятой (#8635).
en: Previously, their value was displayed with rounding up to two decimal places in case of the manual editing of bounds (#8635).

source: Ранее приходилось дожидаться окончания выполнения операции, сейчас реализована возможность ее быстрой отмены и последующей коррекции.
en: Previously, it was required to wait when the operation execution was finished. Now it is possible to cancel it quickly and correct afterwards.

source: Ранее существовала возможность выставить несколько «Назначений» равных «Входное» и «Выходное», что приводило к ошибке в работе узла «Замена» (#8574).
en: Previously, it was possible to set several "Usage types" equal to "Input" and "Output" that resulted in an error in the "Replace" node operation (#8574).

source: Ранее требовалось обязательно задать время.
en: Previously, it was necessarily required to set time.

source: Ранее это можно было сделать только следующим образом: в окне настройки модификатора доступа выбираем статус «Опубликованный», затем задаем имя узла, затем возвращаем прежний статус.
en: Previously, it could be done only in the following way: it was required to select the "Published" status in the access modifier configuration window. Then the node name was set and the previous status was returned.

source: Ранее, в некоторых случаях, переменная пакета PackageFileName содержала пустую строку, вместо имени пакета (#9221).
en: Previously, in some cases, PackageFileName package variable contained an empty row inside the package name (#9221).

source: Ранее, если на сервере было одновременно запущено большое количество сценариев, содержащих узлы, которые ожидают ответы от внешних приложений или сервисов (Выполнение программы, REST-запрос, импорт из Баз данных и тому подобные), то могла наблюдаться ситуация, когда процессор загружен значительно меньше 100%, но новые процессы не выполняются (#7255).
en: Previously, if many workflows containing the nodes that were waiting for responses from the external programs or services (Program execution, Rest request, import from Databases, etc.) were simultaneously started, it could happen that the processor load was much less than 100% but the new processes were not executed (#7255).

source: Ранее, если переданный через Loginom Integrator REST-запрос не содержал тело запроса или валидный json-объект, то появлялось неинформативное сообщение об ошибке «Не задано свойство WebBodyFormatMessageProperty».
en: Previously, if the REST request transferred via Loginom Integrator did not contain the request body or valid json object, the following uninformative error message appeared: "No property specified WebBodyFormatMessageProperty" .

source: Ранее, можно было на выходном порту связывать поле целого типа с вещественным, а поле переменного типа с полями других типов, в результате чего при активации узла возникала ошибка «Смена типа столбца в Импорте LGD не поддерживается» (#10122).
en: Previously, it was possible to connect the field related to the integer type with the real one at the output port, and the field related to the variable type with the fields related to other types that caused the following error when activating the node: "Change of column type is not supported in LGD Import" (#10122).

source: Ранее, пользователь, пароль которого в Active Directory содержал русские буквы, не мог авторизоваться в Loginom через LDAP.
en: Previously, if the user whose password in Active Directory contained the Russian letters, could not log in Loginom via LDAP.

source: Ранее, при отрытии пакетов, созданных в предыдущих версиях Loginom, пользователь мог столкнутся с ситуацией, когда порядок столбцов в диаграмме с накоплением идет в обратном порядке относительно легенды (#9244).
en: Previously, when opening the packages created in the previous Loginom versions, a user could face the situation when the order of columns in the chart with accumulation was in reverse order relative to legend (#9244).

source: Расположение папки, из которой загружаются конфигурационные файлы Integrator.dll.config и appsettings.json, определяется по следующим правилам:
en: Location of the folder from which Integrator.dll.config and appsettings.json configuration files are downloaded is defined according to the following rules:

source: Рассмотрим подробнее некоторые изменения.
en: Let's consider some changes in detail.

source: Реализован способ исправления ошибок (#9189).
en: Error correction method was implemented (#9189).

source: Реализован способ обходить проблему, являющуюся особенностью реализации интерпретатора Python при его подключении в виде динамической библиотеки.
en: It became possible to sidestep the problem that is typical of the Python interpreter implementation when it was connected in the dynamic library form.

source: Реализован удобный функционал в переиспользовании компонентов.
en: Convenient functionality of components reuse was implemented.

source: Реализован функционал быстрого просмотра результатов вычислений при выделении активизированного узла.
en: Quick view of the calculation results functionality was implemented for selection of the activated node.

source: Реализован функционал мониторинга пользователей и пакетов.
en: Functionality of users and packages monitoring was implemented.

source: Реализована возможность в импорте из файлов (txt, csv, XML, Excel) читать данные предварительно выполнив http-запрос.
en: It became possible to read data importing from files (txt, csv, XML, Excel) having executed http request beforehand.

source: Реализована возможность предварительного просмотра результатов расчетов Калькулятора.
en: Option of the Calculator calculation results preview was implemented.

source: Реализована установка роли для нового пользователя, автоматически добавляемого через LDAP, на основе параметра «Роль нового пользователя», который можно настроить в разделе Администрирование в секции LDAP.
en: Now it is possible to set the role for a new user that is automatically added via LDAP using "New user role" parameter that can be configured in the Administration section of the LDAP section.
